       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-JUMP-SUB.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-MESSAGE          PIC X(20) VALUE 'HELLO FROM SUB'.

       PROCEDURE DIVISION.
       SUB-SECTION.
           DISPLAY WS-MESSAGE.
           GOBACK.
