       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-JUMP-MAIN.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-MESSAGE          PIC X(20) VALUE 'HELLO FROM MAIN'.

       PROCEDURE DIVISION.
       MAIN-SECTION.
           DISPLAY WS-MESSAGE.
           CALL 'CALL-JUMP-SUB'.
           GOBACK.
